Tekla.Structures.Catalogs.ComponentItem
The ComponentItem class contains information about the components in the Tekla Structures catalog.

Tekla.Structures.Catalogs.ComponentItem.#ctor
Creates a new component item instance.

Tekla.Structures.Catalogs.ComponentItem.UIName
The component item's name which is visible in the Tekla Structures user interface.

Tekla.Structures.Catalogs.ComponentItem.Name
The component item's internal name which is used by Tekla Structures in component identification.

Tekla.Structures.Catalogs.ComponentItem.Type
The component item's type.

Tekla.Structures.Catalogs.ComponentItem.Number
The component item's internal number which is used by Tekla Structures in component identification.

Tekla.Structures.Catalogs.ComponentItem.AttributeFileExtension
Gets the attribute file extension of item from the component database.
Returns: File extension on success, empty string if not found.

Tekla.Structures.Catalogs.ComponentItem.Select(System.String,System.Int32)
Selects the component item from the component database. Uses the type if defined for selection
name: The name of the component item to select.
number: The number of the component item to select.
Returns: True on success.

Tekla.Structures.Catalogs.ComponentItem.Select(System.String,System.Int32,Tekla.Structures.Catalogs.ComponentItem.ComponentTypeEnum)
Selects the component item from the component database.
name: The name of the component item to select.
number: The number of the component item to select.
type: The type of the component item to select.
Returns: True on success.

Tekla.Structures.Catalogs.ComponentItem.Export(System.String@)
Exports the custom component item in *.uel-format to the to given file name.
If path is not given custom component is exported to model folder.
If filename is empty custom component name is used as filename.
using System;
using Tekla.Structures.Catalogs;
public class Example
{
public void Example1()
{
ComponentItem item = new ComponentItem();
int version = 0;
string componentName = "General_Tie";
if (item.Select(componentName, -1))
{
string filename = System.IO.Path.GetTempPath() + "\\" + componentName;
if (item.Export(ref filename))
{
Console.WriteLine("Custom component exported successfully");
}
}
}
}
filename: The export file name of the component item.
Returns: True on success.

Tekla.Structures.Catalogs.ComponentItem.GetVersion(System.Int32@)
Gets the version number of custom component item from the component database.
version: The version number of the component item.
Returns: Version number on success, int.MinValue if not found.